Revit 2027 API
ParameterTypeId.InfrastructureAlignmentName Property
 "Name"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId InfrastructureAlignmentName { get; }
Public Shared ReadOnly Property InfrastructureAlignmentName As ForgeTypeId
	Get
public:
static property ForgeTypeId^ InfrastructureAlignmentName {
	ForgeTypeId^ get ();
}
static member InfrastructureAlignmentName : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace